<?php
// +----------------------------------------------------------------------
// | HiPHP框架[基于ThinkPHP6.0开发]
// +----------------------------------------------------------------------
// | Copyright (c) http://www.hiphp.net
// +----------------------------------------------------------------------
// | HiPHP承诺基础框架永久免费开源，您可用于学习和商用，但必须保留软件版权信息。
// +----------------------------------------------------------------------
// | Author: 祈陌 <3411869134@qq.com>，开发者QQ群：829699898
// +----------------------------------------------------------------------
/**
 * 插件基本信息
 */
return [
    // 插件名[必填]，格式：开发者标识+(下划线)英文小写字母
    'name'        => 'cloud',
    // 插件标题[必填]
    'title'       => '云端推送',
    // 模块唯一标识[必填]，格式：插件名.plugin.[应用市场分支ID]
    'identifier'  => 'cloud.plugin',
    // 插件图标[必填]
    'icon'        => '/static/p_cloud/images/app.png',
    // 插件描述[选填]
    'intro' => '系统插件，用于与官方平台的数据推送',
    // 插件作者[必填]
    'author'      => 'hiphp',
    // 作者主页[选填]
    'author_url'  => 'www.hiphp.net',
    // 版本[必填],格式采用三段式：主版本号.次版本号.修订版本号
    // 主版本号【位数变化：1-99】：当模块出现大更新或者很大的改动，比如整体架构发生变化。此版本号会变化。
    // 次版本号【位数变化：0-999】：当模块功能有新增或删除，此版本号会变化，如果仅仅是补充原有功能时，此版本号不变化。
    // 修订版本号【位数变化：0-999】：一般是 Bug 修复或是一些小的变动，功能上没有大的变化，修复一个严重的bug即发布一个修订版。
    'version'     => '1.0.0',
    // 原始数据库表前缀,插件带sql文件时必须配置
    'db_prefix' => 'pre_',
     // 语言包
    'language' => [],
    // 数据表
    'tables' => [],
    //格式['sort' => '100','title' => '配置标题','name' => '配置名称','type' => '配置类型','options' => '配置选项','value' => '配置默认值', 'tips' => '配置提示'] 各参数设置可参考管理后台->系统->系统功能->配置管理->添加
    'config'    => [
],
];