<?php
// +----------------------------------------------------------------------
// | HiPHP框架[基于ThinkPHP6.0开发]
// +----------------------------------------------------------------------
// | Copyright (c) http://www.hiphp.net
// +----------------------------------------------------------------------
// | HiPHP承诺基础框架永久免费开源，您可用于学习和商用，但必须保留软件版权信息。
// +----------------------------------------------------------------------
// | Author: 祈陌 <3411869134@qq.com>，开发者QQ群：829699898
// +----------------------------------------------------------------------
/**
 * 插件后台菜单
 * 字段说明
 * url【链接地址】如果不是外链请设置为默认：system/plugin/run
 * param【扩展参数】格式：_p=cloud&_c=控制器&_a=方法&aaa=自定义参数
 * 当url值为：system/plugin/run时，param必须录入，且_p=cloud是必传参数
 */
return [
    [
        'title'         => '云端推送',
        'icon'          => '',
        'url'           => '',
        'param'         => '',
        'target'        => '_self',
        'sort'          => 0,
        'create_time'          => time(),
        'childs' => []
    ],
];